In [2]:
import pandas as pd
df = pd.read_csv("titanicdata.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [5]:
target = df.Survived
inputs = df.drop('Survived', axis='columns')

target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [6]:
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [9]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [10]:
inputs = pd.concat([inputs, dummies], axis = 'columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [11]:
inputs.drop(['Sex'],axis='columns',inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

Lets find any NaN in any of the columns.

In [12]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

So, Age column is having NaN's.

In [14]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [15]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [16]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [19]:
inputs.Age = round(inputs.Age)

In [20]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    30.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [62]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs, target, test_size=0.2)

In [26]:
len(X_train
   )

712

In [27]:
len(X_test)

179

In [63]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [64]:
model.fit(X_train, y_train)

GaussianNB()

In [65]:
model.score(X_test, y_test)

0.8156424581005587

In [66]:
X_test[:10]

     Pclass   Age     Fare  female  male
853       1  16.0  39.4000       1     0
691       3   4.0  13.4167       1     0
846       3  30.0  69.5500       0     1
100       3  28.0   7.8958       1     0
801       2  31.0  26.2500       1     0
14        3  14.0   7.8542       1     0
723       2  50.0  13.0000       0     1
643       3  30.0  56.4958       0     1
20        2  35.0  26.0000       0     1
122       2  32.0  30.0708       0     1

In [67]:
y_test[:10]

853    1
691    1
846    0
100    0
801    1
14     0
723    0
643    1
20     0
122    0
Name: Survived, dtype: int64

In [68]:
model.predict(X_test[:10])

array([1, 1, 0, 1, 1, 1, 0, 0, 0, 0], dtype=int64)

In [69]:
model.predict_proba(X_test[:10])

array([[0.00503736, 0.99496264],
       [0.03848776, 0.96151224],
       [0.96424673, 0.03575327],
       [0.06617997, 0.93382003],
       [0.02968506, 0.97031494],
       [0.05136944, 0.94863056],
       [0.97312815, 0.02687185],
       [0.97727604, 0.02272396],
       [0.97283039, 0.02716961],
       [0.97116376, 0.02883624]])